Repository: icsharpcode/ILSpy
Catalog: ILSpy/Properties/Resources.*.resx
Languages: de, zh_hans, zh_hant

source: About
de: Über
zh_hans: 关于
zh_hant: 關於

source: Add preconfigured list...
de: Vorkonfigurierte Liste hinzufügen...
zh_hans: 添加预配置列表...
zh_hant: 加入預先設置列表

source: Add shell integration
de: Explorer-Integration hinzufügen
zh_hans: 添加文件资源管理器集成
zh_hant: 加入系統殼層整合

# AddShellIntegrationMessage
source: This will add "{0}" to the registry at "HKCU\Software\Classes\dllfile\shell\Open with ILSpy\command" and "HKCU\Software\Classes\exefile\shell\Open with ILSpy\command" to allow opening .dll and .exe files from the Windows Explorer context menu. Do you want to continue?
de: Dies fügt "{0}" zu den Registrierungszweigen "HKCU\Software\Classes\dllfile\shell\Open with ILSpy\command" und "HKCU\Software\Classes\exefile\shell\Open with ILSpy\command" hinzu. Dadurch können .dll- und .exe-Dateien im Explorer-Kontextmenü mit ILSpy geöffnet werden. Möchten Sie fortfahren?
zh_hans: 这会在注册表的“HKCU\Software\Classes\dllfile\shell\Open with ILSpy\command”与“HKCU\Software\Classes\exefile\shell\Open with ILSpy\command”中添加“{0}”。这样在文件资源管理器中，.dll 文件与 .exe 文件可以在右键菜单中使用 ILSpy 打开。 确定继续？
zh_hant: 這會在系統登錄的 "HKCU\Software\Classes\dllfile\shell\Open with ILSpy\command" 和 "HKCU\Software\Classes\exefile\shell\Open with ILSpy\command" 機碼中新增 "{0}，從而允許在檔案總管內的快顯選單中開啟 .dll 和 .exe 檔案。 是否繼續?

source: |All Files|*.*
de: |Alle Dateien|*.*
zh_hans: |所有文件|*.*
zh_hant: |所有檔案|*.*

source: Allow multiple instances
de: Mehrere Instanzen zulassen
zh_hans: 允许多个实例
zh_hant: 允許同時運行多個實例

# AlwaysBraces
source: Always use braces
de: Immer geschweifte Klammern verwenden
zh_hans: 始终使用大括号
zh_hant: 始終使用大括號

source: Analyze
de: Analysieren
zh_hans: 分析
zh_hant: 分析

source: Assemblies
de: Assemblys
zh_hans: 程序集
zh_hant: 程式集

source: Assembly
zh_hans: 程序集
zh_hant: 程式集

# AssemblySaveCodeDirectoryNotEmpty
source: The directory is not empty. File will be overwritten. Are you sure you want to continue?
de: Verzeichnis ist nicht leer. Dateien werden überschrieben. Möchten Sie fortfahren?
zh_hans: 目录非空。文件会被覆盖。 确定继续？
zh_hant: 此資料夾不為空，原有文件將被覆蓋。 是否繼續?

# AssemblySaveCodeDirectoryNotEmptyTitle
source: Project Directory not empty
de: Verzeichnis nicht leer
zh_hans: 项目目录非空
zh_hant: 專案資料夾不為空

# AutomaticallyCheckUpdatesEveryWeek
source: Automatically check for updates every week
de: Automatisch wöchentlich auf Updates prüfen
zh_hans: 每周自动检查更新
zh_hant: 每週自動檢查更新

source: Back
de: Zurück
zh_hans: 后退
zh_hant: 後退

source: Base Types
de: Basistypen
zh_hans: 基类型
zh_hant: 基礎類型

source: C_lone
de: K_lonen
zh_hans: 克隆(_L)
zh_hant: 複製(_L)

source: Cancel
de: Abbrechen
zh_hans: 取消
zh_hant: 取消

# CannotAnalyzeMissingRef
source: Entity could not be resolved. Cannot analyze entities from missing assembly references. Add the missing reference and try again.
de: Analyse nicht möglich: Fehlende Referenz.
zh_hans: 无法解析实体。可能是由于缺少程序集引用。请添加缺少的程序集并重试。
zh_hant: 無法解析缺少程式集參考的實體，請補齊缺失的程式集後再試一次。

# CannotCreatePDBFile
source: Cannot create PDB file for {0}, because it does not contain a PE Debug Directory Entry of type 'CodeView'.
de: PDB-Datei konnte nicht erstellt werden.
zh_hans: 无法创建为{0}创建PDB文件,因为它不包含PE调试目录类型 'CodeView'.
zh_hant: 由於缺少 PE 偵錯資料夾類型 'CodeView'，因此無法為 {0} 建立 PDB 檔案。

source: Check again
de: Erneut prüfen
zh_hans: 再次检查
zh_hant: 再次檢查...

# CheckUpdates
source: Check for updates
de: Nach Updates suchen
zh_hans: 检查更新
zh_hant: 檢查更新

source: Checking...
de: Überprüfe...
zh_hans: 检查...
zh_hant: 檢查...

source: Clear assembly list
zh_hant: 清除程式集清單

source: Close
de: Schließen
zh_hans: 关闭
zh_hant: 關閉

# CollapseTreeNodes
source: Collapse all tree nodes
de: Alle Knoten reduzieren
zh_hans: 折叠所有树节点
zh_hant: 摺疊所有樹節點

source: Copy
de: Kopieren
zh_hans: 复制
zh_hant: 複製

source: Copy error message
de: Fehler beim Kopieren
zh_hans: 复制错误信息
zh_hant: 複製錯誤資訊

# CopyName
source: Copy FQ Name
de: Namen kopieren
zh_hans: 复制完全限定名称
zh_hant: 複製完全限定名稱 (Fully-Qualified Name)

# CouldNotUseSdkStyleProjectFormat
source: Could not use SDK-style project format, because no compatible target-framework moniker was found.
de: Konnte das SDK-Projektformat nicht verwenden.
zh_hans: 无法使用SDK-style项目格式，因为发现有不兼容目标框架别名。
zh_hant: 由於發現了不相容的框架別名，所以無法使用 .NET SDK 格式的專案

source: Create
de: Erstellen
zh_hans: 创建
zh_hant: 建立

# CultureLabel
source: Culture
de: Kultur
zh_hans: 区域
zh_hant: 區域

# DEBUGDecompile
source: DEBUG -- Decompile All
de: DEBUG: Dekompilieren
zh_hans: 调试 -- 全部反编译到 C#
zh_hant: 偵錯 -- 全部反編譯至 C#

source: DEBUG -- Decompile 100x
de: DEBUG: 100x dekompilieren
zh_hans: 调试 -- 反编译100次
zh_hant: 偵錯 -- 反編譯 100 次

# DEBUGDisassemble
source: DEBUG -- Disassemble All
de: DEBUG: Disassemblieren
zh_hans: 调试 -- 全部反编译到 IL
zh_hant: 偵錯 -- 全部反編譯至 IL

source: DEBUG -- Dump PDB as XML
de: DEBUG: PDB als XML exportieren
zh_hans: 调试 -- PDB 转储为 XML
zh_hant: 偵錯 -- 將 PDB 傾印成 XML

source: Debug Steps
de: Debug-Schritte
zh_hans: 调试步骤
zh_hant: 偵錯步驟

source: Debug this step
de: Diesen Schritt debuggen
zh_hans: 调试此步骤
zh_hant: 偵錯此步驟

# DecompilationCompleteInF1Seconds
source: Decompilation complete in {0:F1} seconds.
de: Dekompilierung in {0} Sekunden abgeschlossen
zh_hans: 反编译完成。耗时 {0:F1} 秒。
zh_hant: 反編譯完成，耗時 {0:F1} 秒。

source: Decompilation view options
de: Dekompilierungsansicht-Optionen
zh_hans: 反编译视图选项
zh_hant: 反編譯檢視選項

source: Decompilation was cancelled.
de: Dekompilierung wurde abgebrochen
zh_hans: 反编译已取消。
zh_hant: 已取消反編譯。

source: Decompile
de: Dekompilieren
zh_hans: 反编译
zh_hant: 反編譯

# DecompileToNewPanel
source: Decompile to new tab
de: In neuem Panel dekompilieren
zh_hans: 在新选项卡反编译
zh_hant: 在新分頁內反編譯

source: Decompiler
zh_hans: 反编译器
zh_hant: 反編譯器

# DecompilerSettings.AggressiveInlining
source: Always inline local variables if possible
de: Aggressives Inlining
zh_hans: 如果可能，始终内联局部变量
zh_hant: 始終內聯區域變數 (如果可能)

# DecompilerSettings.AllowExtensionAddMethodsInCollectionInitializerExpressions
source: Allow extension 'Add' methods in collection initializer expressions
de: Extension-Add-Methoden in Collection-Initialisierern zulassen
zh_hans: 允许使用 Add 扩展方法的集合初始化器表达式
zh_hant: 允許在集合初始化表答式中使用 'Add' 擴充方法

# DecompilerSettings.AllowExtensionMethodSyntaxOnRef
source: Use 'ref' extension methods
de: Extension-Methoden-Syntax für ref zulassen
zh_hans: 使用 ref 扩展方法
zh_hant: 使用 'ref' 擴充方法

# DecompilerSettings.AlwaysCastTargetsOfExplicitInterfaceImplementationCalls
source: Always cast targets of explicit interface implementation calls
de: Ziele expliziter Schnittstellenimplementierungen immer casten
zh_hans: 始终强制转换显式接口实现调用的目标
zh_hant: 始終將對目標的方法實現轉換為明確介面呼叫

# DecompilerSettings.AlwaysQualifyMemberReferences
source: Always qualify member references
de: Mitgliedsreferenzen immer qualifizieren
zh_hans: 始终限定成员引用
zh_hant: 始終限定成員參考

# DecompilerSettings.AlwaysShowEnumMemberValues
source: Always show enum member values
de: Enum-Mitgliedswerte immer anzeigen
zh_hans: 始终显示枚举数值
zh_hant: 始終顯示列舉成員的對應數值

# DecompilerSettings.AlwaysUseBraces
source: Always use braces
de: Immer geschweifte Klammern verwenden
zh_hans: 始终使用大括号
zh_hant: 始終使用大括號

# DecompilerSettings.AlwaysUseGlobal
source: Always fully qualify namespaces using the "global::" prefix
de: Immer global verwenden
zh_hans: 总是使用 "global::" 完全限定命名空间
zh_hant: 始終使用完全限定命名空間 ("global::" 前綴)

# DecompilerSettings.ApplyWindowsRuntimeProjectionsOnLoadedAssemblies
source: Apply Windows Runtime projections on loaded assemblies
de: Windows-Runtime-Projektionen auf geladene Assemblys anwenden
zh_hans: 在已加载的程序集上应用 Windows 运行时投影
zh_hant: 在已載入的程式集上套用 Windows Runtime 投影

# DecompilerSettings.ArrayInitializerExpressions
source: Array initializer expressions
de: Array-Initialisierer-Ausdrücke
zh_hans: 数组初始化器表达式
zh_hant: 陣列初始化表達式

# DecompilerSettings.AsyncEnumerator
source: Decompile async IAsyncEnumerator methods
de: Asynchrone Enumerator
zh_hans: 反编译异步 IAsyncEnumerator 方法
zh_hant: 反編譯非同度 IAsyncEnumerator 列舉器方法

# DecompilerSettings.AutoLoadAssemblyReferences
source: Automatically load assembly references
zh_hant: 自動載入程式集的參考

# DecompilerSettings.CheckedOperators
source: User-defined checked operators
zh_hant: 使用者定義的 checked 運算子

# DecompilerSettings.DecompileAnonymousMethodsLambdas
source: Decompile anonymous methods/lambdas
de: Anonyme Methoden/Lambdas dekompilieren
zh_hans: 反编译匿名方法或 lambda
zh_hant: 反編譯匿名方法/lambda 表達式

# DecompilerSettings.DecompileAnonymousTypes
source: Decompile anonymous types
de: Anonyme Typen dekompilieren
zh_hans: 反编译匿名类型
zh_hant: 反編譯匿名類型

# DecompilerSettings.DecompileAsyncMethods
source: Decompile async methods
de: Asynchrone Methoden dekompilieren
zh_hans: 反编译异步方法
zh_hant: 反編譯非同步方法

# DecompilerSettings.DecompileAutomaticEvents
source: Decompile automatic events
de: Automatische Events dekompilieren
zh_hans: 反编译自动事件
zh_hant: 反編譯自動事件

# DecompilerSettings.DecompileAutomaticProperties
source: Decompile automatic properties
de: Automatische Eigenschaften dekompilieren
zh_hans: 反编译自动属性
zh_hant: 反編譯自動屬性

# DecompilerSettings.DecompileAwaitInCatchFinallyBlocks
source: Decompile await in catch/finally blocks
de: await in catch/finally-Blöcken dekompilieren
zh_hans: 反编译 catch/finally 内的 await
zh_hant: 反編譯位於 catch/finally 區塊中的 await

# DecompilerSettings.DecompileC10PublicUnsafeFixedIntArr10Members
source: Decompile C# 1.0 'public unsafe fixed int arr[10];' members
de: C# 10: Öffentliche unsichere feste int[]-Mitglieder dekompilieren
zh_hans: 反编译 C# 1.0“public unsafe fixed int arr[10];”成员
zh_hant: 反編譯 C# 1.0 當中的 'public unsafe fixed int arr[10];' 成員

# DecompilerSettings.DecompileDecimalConstantAsSimpleLiteralValues
source: Decompile [DecimalConstant(...)] as simple literal values
de: Dezimal-Konstanten als einfache Literale dekompilieren
zh_hans: 反编译 [DecimalConstant(...)] 作为简单的字面值
zh_hant: 將 [DecimalConstant(...)] 反編譯為普通常數

# DecompilerSettings.DecompileEnumeratorsYieldReturn
source: Decompile enumerators (yield return)
de: Enumeratoren (yield return) dekompilieren
zh_hans: 反编译枚举器(yield return)
zh_hant: 反編譯列舉器 (yield return)

# DecompilerSettings.DecompileExpressionTrees
source: Decompile expression trees
de: Ausdrucksbäume dekompilieren
zh_hans: 反编译表达树
zh_hant: 反編譯語法表達樹 (expression trees)

# DecompilerSettings.DecompileForEachWithGetEnumeratorExtension
source: Decompile foreach statements with GetEnumerator extension methods
de: foreach mit GetEnumerator-Extension dekompilieren
zh_hans: 反编译使用 GetEnumerator 扩展方法的 foreach 语句
zh_hant: 反編譯基於 GetEnumerator() 擴充方法的 foreach 語法結構

# DecompilerSettings.DecompileUseOfTheDynamicType
source: Decompile use of the 'dynamic' type
de: Verwendung des dynamic-Typs dekompilieren
zh_hans: 反编译 dynamic 类型
zh_hant: 反編譯 'dynamic' 類型

# DecompilerSettings.Deconstruction
source: Detect deconstruction assignments
de: Dekonstruktion
zh_hans: 检测解构赋值
zh_hant: 偵測元組解構賦值

# DecompilerSettings.DetectAsyncUsingAndForeachStatements
source: Detect awaited using and foreach statements
de: Asynchrone using- und foreach-Anweisungen erkennen
zh_hans: 检测使用了 await 的 using 和 foreach 块
zh_hant: 偵測在非同步區塊中的 using 和 foreach 語法結構

# DecompilerSettings.DetectForeachStatements
source: Detect foreach statements
de: foreach-Anweisungen erkennen
zh_hans: 检测 foreach 语句
zh_hant: 偵測 foreach 語法結構

# DecompilerSettings.DetectLockStatements
source: Detect lock statements
de: lock-Anweisungen erkennen
zh_hans: 检测 lock 语句
zh_hant: 偵測 lock 語法結構

# DecompilerSettings.DetectSwitchOnString
source: Detect switch on string
de: switch-Anweisungen auf string erkennen
zh_hans: 检测字符串 switch 语句
zh_hant: 偵測在字串上的 switch 語法結構

# DecompilerSettings.DetectTupleComparisons
source: Detect tuple comparisons
de: Tupelvergleiche erkennen
zh_hans: 检测元组比较
zh_hant: 偵測元祖比較

# DecompilerSettings.DetectUsingStatements
source: Detect using statements
de: using-Anweisungen erkennen
zh_hans: 检测 using 语句
zh_hant: 偵測 using 語法結構

# DecompilerSettings.DictionaryInitializerExpressions
source: Dictionary initializer expressions
de: Dictionary-Initialisierer-Ausdrücke
zh_hans: Dictionary 初始值设定项表达式
zh_hant: Dictionary 初始化表達式

# DecompilerSettings.DoWhileStatement
source: Transform to do-while, if possible
de: do-while-Anweisung
zh_hans: 如果可能，转换到 do-while 块
zh_hant: 將迴圈轉換成 do-while (如果可能)

# DecompilerSettings.FSpecificOptions
source: F#-specific options
de: F#-spezifische Optionen
zh_hans: F# 特定选项
zh_hant: F# 特定選項

# DecompilerSettings.FileScopedNamespaces
source: Use file-scoped namespace declarations
de: Datei-scoped Namespaces
zh_hans: 使用文件作用域命名空间表达式 (File-scoped namespace)
zh_hant: 使用檔案範圍的命名空間宣告

# DecompilerSettings.ForStatement
source: Transform to for, if possible
de: for-Anweisung
zh_hans: 如果可能，转换到 for 块
zh_hant: 將迴圈轉換成 for-loop (如果可能)

# DecompilerSettings.FunctionPointers
source: Function pointers
de: Funktionszeiger
zh_hans: 函数指针
zh_hant: 函數指標

# DecompilerSettings.GetterOnlyAutomaticProperties
source: Decompile getter-only automatic properties
de: Nur-Getter automatische Eigenschaften
zh_hans: 反编译 getter-only 自动属性
zh_hant: 反編譯只有 getter 存取子的自動唯讀屬性

# DecompilerSettings.IncludeXMLDocumentationCommentsInTheDecompiledCode
source: Include XML documentation comments in the decompiled code
de: XML-Dokumentationskommentare im dekompilierten Code einfügen
zh_hans: 在反编译代码中包括 XML 文档注释
zh_hant: 在反編譯程式碼中附加對應的 XML 方法註釋

# DecompilerSettings.InitAccessors
source: Allow init; accessors
de: Init-Accessoren
zh_hans: 允许 init; 访问器
zh_hant: 允許 init; 存取子

# DecompilerSettings.InsertUsingDeclarations
source: Insert using declarations
de: using-Deklarationen einfügen
zh_hans: 插入 using 声明
zh_hant: 插入 using 宣告

# DecompilerSettings.IntroduceLocalFunctions
source: Introduce local functions
de: Lokale Funktionen einführen
zh_hans: 引入局部函数(local functions)
zh_hant: 引入局部函數(local functions)

# DecompilerSettings.IntroduceStaticLocalFunctions
source: Introduce static local functions
de: Statische lokale Funktionen einführen
zh_hans: 引入静态局部函数(static local functions)
zh_hant: 引入靜態區域函數(static local functions)

# DecompilerSettings.IsByRefLikeAttributeShouldBeReplacedWithRefModifiersOnStructs
source: IsByRefLikeAttribute should be replaced with 'ref' modifiers on structs
de: IsByRefLike-Attribut durch ref-Modifier bei Structs ersetzen
zh_hans: IsByRefLikeAttribute 应替换为结构上的 ref 修饰符
zh_hant: 將在結構上的 IsByRefLikeAttribute 替換成 'ref' 修飾詞

source: IsReadOnlyAttribute should be replaced with 'readonly'/'in' modifiers on structs/parameters
de: IsReadOnly-Attribut durch readonly-Modifier bei Structs/Parametern ersetzen
zh_hans: IsReadOnlyAttribute 应替为结构参数上的 readonly/in 中的修饰符
zh_hant: 將在結構/參數上的 IsReadOnlyAttribute 替換成 'readonly/in' 修飾詞

source: IsUnmanagedAttribute on type parameters should be replaced with 'unmanaged' constraints
de: IsUnmanaged-Attribut durch unmanaged-Einschränkung ersetzen
zh_hans: 类型参数上的 IsUnmanagedAttribute 应替换为 unmanaged 约束
zh_hant: 將類型參數上的 IsUnmanagedAttribute 替換成 'unmanaged' 約束

# DecompilerSettings.NativeIntegers
source: Use nint/nuint types
de: Native Integer
zh_hans: 使用 nint/nuint 类型
zh_hant: 使用 nint/nuint 類型

# DecompilerSettings.NullPropagation
source: Decompile ?. and ?[] operators
de: Null-Propagation
zh_hans: 反编译 ?. 和 ?[] 运算符
zh_hant: 反編譯 ?. 和 ?[] 運算子

# DecompilerSettings.NullableReferenceTypes
source: Nullable reference types
zh_hans: 可空引用类型
zh_hant: 可 null 的參考類型

# DecompilerSettings.NumericIntPtr
source: Treat (U)IntPtr as n(u)int
zh_hant: 將 (U)IntPtr 視為 n(u)int

# DecompilerSettings.ObjectCollectionInitializerExpressions
source: Object/collection initializer expressions
de: Objekt-/Collection-Initialisierer-Ausdrücke
zh_hans: 对象或集合初始化器表达式
zh_hant: 物件/集合初始化表達式

# DecompilerSettings.Other
source: Other
de: Weitere Optionen
zh_hans: 其他
zh_hant: 其他

# DecompilerSettings.PatternCombinators
source: Pattern combinators (and, or, not)
zh_hant: 合併模式比對 (and, or, not)

# DecompilerSettings.PatternMatching
source: Use pattern matching expressions
de: Pattern Matching
zh_hans: 使用模式匹配表达式
zh_hant: 使用模式比對表達式

# DecompilerSettings.ProjectExport
source: Project export
de: Projekt-Export
zh_hans: 项目导出
zh_hant: 輸出專案

# DecompilerSettings.Ranges
source: Ranges
zh_hans: 范围(ranges)
zh_hant: 範圍運算子

# DecompilerSettings.ReadOnlyMethods
source: Read-only methods
de: Readonly-Methoden
zh_hans: 只读方法
zh_hant: 唯讀方法

# DecompilerSettings.RecordClasses
source: Record classes
de: Record-Klassen
zh_hans: 记录
zh_hant: 紀錄類別 (record/record class)

# DecompilerSettings.RecordStructs
source: Record structs
zh_hans: 记录结构
zh_hant: 紀錄結構 (record struct)

# DecompilerSettings.RecursivePatternMatching
source: Recursive pattern matching
zh_hant: 遞迴模式比對

# DecompilerSettings.RefReadOnlyParameters
source: 'ref readonly' parameters
zh_hant: 'ref readonly' 參數

# DecompilerSettings.RelationalPatterns
source: Relational patterns
zh_hant: 關聯式模式

# DecompilerSettings.RemoveDeadAndSideEffectFreeCodeUseWithCaution
source: Remove dead and side effect free code (use with caution!)
de: Toten und nebenwirkungsfreien Code entfernen (mit Vorsicht verwenden)
zh_hans: 删除死代码和无副作用的代码(请谨慎使用)
zh_hant: 刪除死程式碼和無副作用的程式碼

# DecompilerSettings.RemoveDeadStores
source: Remove dead stores (use with caution!)
de: Tote Stores entfernen
zh_hans: 删除死值(请谨慎使用)
zh_hant: 刪除死值(請謹慎使用!)

# DecompilerSettings.RemoveOptionalArgumentsIfPossible
source: Remove optional arguments, if possible
de: Optionale Argumente wenn möglich entfernen
zh_hans: 如果可能，删除可选参数
zh_hant: 刪除可選參數(如果可能)

# DecompilerSettings.RequiredMembers
source: Required members
de: Erforderliche Mitglieder
zh_hans: Required 必要成员
zh_hant: Required 必要成員

# DecompilerSettings.ScopedRef
source: 'scoped' lifetime annotation
zh_hant: 'scoped' 生命週期關鍵字

# DecompilerSettings.SeparateLocalVariableDeclarations
source: Separate local variable declarations and initializers (int x = 5; -> int x; x = 5;), if possible
de: Lokale Variablendeklarationen trennen
zh_hans: 如果可能，分离局部变量的声明与初始化（int x = 5; -> int x; x = 5;）
zh_hant: 分離區域變數的宣告和初始化 (int x = 5; -> int x; x = 5;) (如果可能)

# DecompilerSettings.ShowInfoFromDebugSymbolsIfAvailable
source: Show info from debug symbols, if available
de: Informationen aus Debug-Symbolen anzeigen (falls verfügbar)
zh_hans: 显示调试符号中的信息(如果可用)
zh_hant: 顯示偵錯符號中的資訊(如果存在)

# DecompilerSettings.SparseIntegerSwitch
source: Detect switch on integer even if IL code does not use a jump table
de: Sparse Integer Switch
zh_hans: 检测整型 switch 即使 IL 代码不使用跳转表
zh_hant: 偵測在整數類型上可能的 switch 結構，即便 IL 指令層面上並未使用跳躍表

# DecompilerSettings.StringConcat
source: Decompile 'string.Concat(a, b)' calls into 'a + b'
de: String-Verkettung
zh_hans: 反编译 'string.Concat(a, b)' 调用为 'a + b'
zh_hant: 將 'string.Concat(a, b)' 呼叫反編譯為 'a + b'

# DecompilerSettings.SwitchExpressions
source: Switch expressions
de: Switch-Ausdrücke
zh_hans: switch 表达式
zh_hant: switch 表達式

# DecompilerSettings.SwitchOnReadOnlySpanChar
source: Use switch on (ReadOnly)Span<char>
zh_hant: 在 (ReadOnly)Span<char> 上使用 switch 表達式

# DecompilerSettings.UnsignedRightShift
source: Unsigned right shift (>>>)
zh_hant: 無符號右移運算子 (>>>)

# DecompilerSettings.UseDiscards
source: Use discards
de: Discards verwenden
zh_hans: 使用弃元
zh_hant: 使用捨棄變數 _

# DecompilerSettings.UseEnhancedUsing
source: Use enhanced using variable declarations
de: Erweitertes using verwenden
zh_hans: 使用增强的 using 变量声明
zh_hant: 使用增強的 using 變數聲明

# DecompilerSettings.UseExpressionBodiedMemberSyntaxForGetOnlyProperties
source: Use expression-bodied member syntax for get-only properties
de: Expression-bodied Syntax für Nur-Getter-Eigenschaften verwenden
zh_hans: 对仅有 getter 访问器的属性使用 Expression-bodied 成员语法
zh_hant: 對只有 getter 存取子的屬性使用 Expression-bodied 語法

# DecompilerSettings.UseExtensionMethodSyntax
source: Use extension method syntax
de: Extension-Methoden-Syntax verwenden
zh_hans: 使用扩展方法语法
zh_hant: 使用擴充方法語法

# DecompilerSettings.UseImplicitConversionsBetweenTupleTypes
source: Use implicit conversions between tuple types
de: Implizite Konvertierungen zwischen Tupeltypen verwenden
zh_hans: 在元组类型之间使用隐式转换
zh_hant: 在元組類型之間使用隱式轉換

# DecompilerSettings.UseImplicitMethodGroupConversions
source: Use implicit method group conversions
de: Implizite Methodengruppenkonvertierungen verwenden
zh_hans: 使用隐式方法组转换
zh_hant: 使用隱式方法組轉換

# DecompilerSettings.UseLINQExpressionSyntax
source: Use LINQ expression syntax
de: LINQ-Ausdruckssyntax verwenden
zh_hans: 使用 LINQ 表达式语法
zh_hant: 使用 LINQ 表達式語法

# DecompilerSettings.UseLambdaSyntaxIfPossible
source: Use lambda syntax, if possible
de: Lambda-Syntax wenn möglich verwenden
zh_hans: 如果可能, 请使用 lambda 语法
zh_hant: 使用 lambda 語法(如果可能)

# DecompilerSettings.UseLiftedOperatorsForNullables
source: Use lifted operators for nullables
de: Lifted-Operatoren für Nullables verwenden
zh_hans: 对可为空类型使用提升运算符
zh_hant: 為可為 null 的類型使用提升運算子

# DecompilerSettings.UseNamedArguments
source: Use named arguments
de: Benannte Argumente verwenden
zh_hans: 使用命名参数
zh_hant: 使用命名參數

# DecompilerSettings.UseNestedDirectoriesForNamespaces
source: Use nested directories for namespaces
de: Verschachtelte Verzeichnisse für Namespaces verwenden
zh_hans: 为命名空间使用嵌套目录
zh_hant: 為命名空間使用巢狀路徑

# DecompilerSettings.UseNonTrailingNamedArguments
source: Use non-trailing named arguments
de: Nicht-nachgestellte benannte Argumente verwenden
zh_hans: 使用非尾随命名参数
zh_hant: 使用非尾隨命名參數

# DecompilerSettings.UseOutVariableDeclarations
source: Use out variable declarations
de: out-Variablendeklarationen verwenden
zh_hans: 使用 out 变量声明
zh_hant: 使用 out 變數宣告

# DecompilerSettings.UsePatternBasedFixedStatement
source: Use pattern-based fixed statement
de: Musterbasierte fixed-Anweisung verwenden
zh_hans: 使用基于模式的 fixed 语句
zh_hant: 使用基於模式的 fixed 陳述式

# DecompilerSettings.UsePrimaryConstructorSyntax
source: Use primary constructor syntax with records
de: Primärkonstruktor-Syntax verwenden
zh_hans: 使用带有记录的主构造器语法
zh_hant: 在 record 類型上使用主建構子語法

# DecompilerSettings.UseRefLocalsForAccurateOrderOfEvaluation
source: Use ref locals to accurately represent order of evaluation
de: ref-locals für genaue Auswertungsreihenfolge verwenden
zh_hans: 使用 ref 局部变量以准确表达求值顺序
zh_hant: 使用 ref 局部變數來準確生成求值數訊

# DecompilerSettings.UseSdkStyleProjectFormat
source: Use new SDK style format for generated project files (*.csproj)
de: SDK-Projektformat verwenden
zh_hans: 使用新的 SDK 样式(*.csproj)生成项目文件
zh_hant: 為生成的專案檔案(*.csproj)採用新的 .NET SDK 格式

# DecompilerSettings.UseStackallocInitializerSyntax
source: Use stackalloc initializer syntax
de: stackalloc-Initialisierer-Syntax verwenden
zh_hans: 使用 stackalloc 初始化器语法
zh_hant: 使用 stackalloc 初始化語法

# DecompilerSettings.UseStringInterpolation
source: Use string interpolation
de: String-Interpolation verwenden
zh_hans: 使用字符串内插
zh_hant: 使用字串內插語法

# DecompilerSettings.UseThrowExpressions
source: Use throw expressions
de: throw-Ausdrücke verwenden
zh_hans: 使用 throw 表达式
zh_hant: 使用 throw 表達式

# DecompilerSettings.UseTupleTypeSyntax
source: Use tuple type syntax
de: Tupeltyp-Syntax verwenden
zh_hans: 使用元组类型语法
zh_hant: 使用元組類型語法

# DecompilerSettings.UseVariableNamesFromDebugSymbolsIfAvailable
source: Use variable names from debug symbols, if available
de: Variablennamen aus Debug-Symbolen verwenden (falls verfügbar)
zh_hans: 使用调试符号中的变量名(如果可用)
zh_hant: 使用偵錯符號中的變數名稱(如果存在)

# DecompilerSettings.Utf8StringLiterals
source: UTF-8 string literals
zh_hant: UTF-8 字面常數

# DecompilerSettings.VBSpecificOptions
source: VB-specific options
de: VB-spezifische Optionen
zh_hans: VB 特定选项
zh_hant: VB 特定選項

# DecompilerSettings.WithExpressions
source: 'with' initializer expressions
de: with-Ausdrücke
zh_hans: 'with' 初始化器表达式
zh_hant: 'with' 初始化表達式

# DecompilerSettingsPanelLongText
source: The settings selected below are applied to the decompiler output in combination with the selection in the language drop-down. Selecting a lower language version in the drop-down will deactivate all selected options of the higher versions. Note that some settings implicitly depend on each other, e.g.: LINQ expressions cannot be introduced without first transforming static calls to extension method calls.
de: Weitere Decompiler-Optionen
zh_hans: 下面选择的设置将与语言下拉列表中的选择一起应用于反编译程序输出。在下拉列表中选择较低的语言版本将停用较高版本的所有选定选项。请注意, 某些设置隐式依赖于彼此, 例如: 如果不首先将静态调用转换为扩展方法调用, 则无法引入 LINQ 表达式。
zh_hant: 下方選擇的設定項目將與語言列表中的選擇項目一起決定反編譯器的輸出。在列表中選擇較低的語言版本將停用較高語言版本的所有選擇項目 (部分設定會互相影響，例如: LINQ 表達式無法在不將靜態呼叫轉換為擴充方法呼叫的情況下生成)
