Repository: icsharpcode/ILSpy
Catalog: ILSpy/Properties/Resources.*.resx
Languages: de, zh_hans, zh_hant

source: Decompiling...
de: Dekompiliere...
zh_hans: 正在反编译...
zh_hant: 反編譯中...

source: Dependencies
de: Abhängigkeiten
zh_hans: 依赖(_L)
zh_hant: 相依性(_L)

source: Derived Types
de: Abgeleitete Typen
zh_hans: 派生类型
zh_hant: 衍生類型

source: Display
de: Anzeigen
zh_hans: 显示
zh_hant: 顯示

source: Display Code
de: Code anzeigen
zh_hans: 显示代码
zh_hant: 顯示程式碼

# DisplaySettingsPanel_Font
source: Font:
de: Schriftart
zh_hans: 字体:
zh_hant: 字型:

# DisplaySettingsPanel_Theme
source: Theme:
de: Thema
zh_hans: 主题:
zh_hant: 主題:

source: Download
de: Herunterladen
zh_hans: 下载
zh_hant: 下載

source: E_xit
de: B_eenden
zh_hans: 退出(_X)
zh_hant: 退出(_X)

source: Editor
zh_hans: 编辑器
zh_hant: 編輯器

# EnableFoldingBlocksBraces
source: Enable folding on all blocks in braces
de: Faltblöcke/Klammern aktivieren
zh_hans: 在大括号中的所有块上启用折叠
zh_hant: 為大括號之間的所有區塊啟用摺疊功能

source: Enable word wrap
de: Zeilenumbruch aktivieren
zh_hans: 启用自动换行
zh_hant: 啟用自動換行

# EnterListName
source: Enter a list name:
de: Listenname eingeben
zh_hans: 输入列表名称：
zh_hant: 輸入列表名稱:

source: Exit
de: Beenden
zh_hans: 退出
zh_hant: 退出

source: Expand member definitions after decompilation
de: Mitgliedsdefinitionen nach Dekompilierung erweitern
zh_hans: 在反编译后展开成员定义
zh_hant: 反編譯後展開成員定義

source: Expand using declarations after decompilation
de: using-Deklarationen nach Dekompilierung erweitern
zh_hans: 反编译后展开引用和声明
zh_hant: 反編譯後展開 using 宣告

source: Extract package entry
de: Paket-Eintrag extrahieren
zh_hans: 提取包条目
zh_hant: 取出套件項目

source: Folding
de: Faltung
zh_hans: 折叠
zh_hant: 摺疊

source: Font
de: Schriftart
zh_hans: 字体
zh_hant: 字型

source: Forward
de: Vorwärts
zh_hans: 前进
zh_hant: 前進

# GeneratePortable
source: Generate portable PDB
de: Portable generieren
zh_hans: 生成 Portable PDB
zh_hant: 生成可攜式 PDB...

# GenerationCompleteInSeconds
source: Generation complete in {0} seconds.
de: Generierung in Sekunden abgeschlossen
zh_hans: 生成完成，耗时 {0} 秒。
zh_hant: 生成完成，耗時 {0} 秒。

source: Generation was cancelled.
de: Generierung wurde abgebrochen
zh_hans: 已取消生成。
zh_hant: 已取消生成。

source: Go to token
de: Zu Token springen
zh_hans: 转至令牌
zh_hant: 跳轉至標記

# HideEmptyMetadataTables
source: Hide empty metadata tables from tree view
de: Leere Metadaten-Tabellen ausblenden
zh_hans: 在树视图中隐藏空的元数据表
zh_hant: 在樹狀圖中隱藏空的元資料表

source: Highlight current line
de: Aktuelle Zeile hervorheben
zh_hans: 高亮当前行
zh_hant: 標記當前行

source: Highlight matching braces
de: Übereinstimmende Klammern hervorheben
zh_hans: 高亮配对的大括号
zh_hant: 標記對應的大括號

source: ILSpyAboutPage.txt
de: ILSpy Über-Seite
zh_hans: ILSpyAboutPage_zh_Hans.txt
zh_hant: ILSpyAboutPage_zh_Hant.txt

source: ILSpy version
zh_hans: ILSpy 版本
zh_hant: ILSpy 版本

# ILSpyVersionAvailable
source: A new ILSpy version is available.
de: ILSpy-Version verfügbar
zh_hans: 有新的 ILSpy 版本已经可用。
zh_hant: 已有更新的 ILSpy 版本。

source: Indent size:
de: Einrückungsgröße
zh_hans: 缩进长度：
zh_hant: 縮排長度:

source: Indentation
de: Einrückung
zh_hans: 缩进
zh_hant: 縮排

source: Insert using declarations
de: using-Deklarationen einfügen
zh_hans: 插入使用声明
zh_hant: 插入 using 宣告

# ListDeleteConfirmation
source: Are you sure that you want to delete the selected assembly list?
de: Liste wirklich löschen?
zh_hans: 是否删除选中的程序集列表？
zh_hant: 是否刪除所選擇的程式集列表?

# ListExistsAlready
source: A list with the same name was found.
de: Liste existiert bereits
zh_hans: 已有同名的列表。
zh_hant: 已有相同名稱的列表。

# ListsResetConfirmation
source: Are you sure that you want to remove all assembly lists and recreate the default assembly lists?
de: Listen wirklich zurücksetzen?
zh_hans: 是否删除所有程序集列表，并重建默认程序集列表？
zh_hant: 是否刪除目前的程式集列表，並重新載入成預設的列表?

source: Load assemblies that were loaded in the last instance.
de: Assemblys aus letzter Sitzung laden
zh_hans: 加载在最后一个实例中加载的程序集。
zh_hant: 加載在最後一次執行時所載入的程式集。

source: Loading...
de: Lädt...
zh_hans: 加载中...
zh_hant: 加載中...

source: Location
de: Speicherort
zh_hans: 位置
zh_hant: 位置

source: Manage Assembly Lists
de: Assembly-Listen verwalten
zh_hans: 管理程序集列表
zh_hant: 管理程式集列表

source: Manage assembly _lists...
de: Assembly-Listen verwalten
zh_hans: 管理程序集列表(_L)...
zh_hant: 管理程式集列表(_L)...

source: Metadata
zh_hant: 元資料

source: Misc
de: Verschiedenes
zh_hans: 杂项
zh_hant: 雜項

# NETFrameworkVersion
source: .NET version
de: .NET Framework-Version
zh_hans: .NET 版本
zh_hant: .NET 版本

source: Name
zh_hans: 名称
zh_hant: 名稱

source: Navigation
zh_hans: 导航
zh_hant: 導覽

# NavigationFailed
source: Navigation failed because the target is hidden or a compiler-generated class.\n Please disable all filters that might hide the item (i.e. activate "View > Show internal types and members") and try again.
de: Navigation fehlgeschlagen, da das Ziel eine ausgeblendete oder vom Compiler generierte Klasse ist. Bitte deaktivieren Sie alle Filter, die diese ausblenden könnten (z.B. "Ansicht > Interne Typen und Mitglieder anzeigen") und versuchen Sie es erneut.
zh_hans: 导航失败，因为目标是隐藏的或编译器生成的类。\n 请禁用所有的、可能隐藏它们的筛选器(例如，启用“视图 > 显示内部类型和成员”)，并重试。
zh_hant: 導覽失敗，因為目標被隱藏或是其為編譯器自動產生的類別。 請移除所有可能會隱藏目標的過濾器 (例如: 勾選 "檢視 > 顯示內部類型和成員") 後，再試一次。

source: New list
de: Neue Liste
zh_hans: 新建列表
zh_hant: 新列表

source: New Tab
de: Neuer Tab
zh_hans: 新选项卡
zh_hant: 新分頁

source: Nuget Package Browser
de: NuGet-Paketbrowser
zh_hans: Nuget 包浏览器
zh_hant: NuGet 套件瀏覽器

source: OK
zh_hans: 确定
zh_hant: 確定

source: Open
de: Öffnen
zh_hans: 打开
zh_hant: 開啟

source: Open Explorer
de: Explorer öffnen
zh_hans: 打开资源管理器
zh_hant: 開啟檔案總管

# OpenFrom
source: Open From GAC
de: Öffnen von
zh_hans: 从 GAC 中打开
zh_hant: 從 GAC 中開啟

source: Open from _GAC...
de: Aus GAC öffnen
zh_hans: 从 GAC 中打开(_G)...
zh_hant: 從 GAC 中開啟(_G)...

# OpenListDialog__Delete
source: _Delete
de: Liste löschen
zh_hans: 删除(_D)
zh_hant: 刪除(_D)

# OpenListDialog__Open
source: _Open
de: Liste öffnen
zh_hans: 打开(_O)
zh_hant: 開啟(_O)

source: Operation was cancelled.
de: Vorgang wurde abgebrochen
zh_hans: 操作已取消。
zh_hant: 操作已取消。

source: Options
de: Optionen
zh_hans: 选项
zh_hant: 選項

source: Other
de: Andere
zh_hans: 其他
zh_hant: 其他

source: Other options
de: Weitere Optionen
zh_hans: 其他选项
zh_hant: 其他選項

source: Other Resources
de: Weitere Ressourcen
zh_hans: 其他资源
zh_hant: 其他資源

source: Portable PDB|*.pdb|All files|*.*
de: Alle Portable PDB/PDB-Dateien
zh_hans: Portable PDB(*.pdb)|*.pdb|所有文件(*.*)|*.*
zh_hant: 可攜式 PDB|*.pdb|所有檔案|*.*

# ProjectExportFormatChangeSettingHint
source: You can change this by toggling the setting at Options > Decompiler > Project export > Use new SDK style format for generated project files (*.csproj).
de: Hinweis: Exportformat kann in den Einstellungen geändert werden.
zh_hans: 你可以切换 选项 > 反编译器 > 其他 > 使用新的 SDK 样式(*.csproj)生成项目文件 设置以改变项目格式。
zh_hant: 您可以在 選項 > 反編譯器 > 匯出專案 > 為生成的專案檔案(*.csproj)採用新的 .NET SDK 格式 來切換此設定

# ProjectExportFormatNonSDKHint
source: A Non-SDK project was generated. Learn more at https://docs.microsoft.com/en-us/nuget/resources/check-project-format.
de: Hinweis: Nicht-SDK-Format wird verwendet.
zh_hans: 已生成非 SDK 样式项目。 访问 https://docs.microsoft.com/zh-cn//nuget/resources/check-project-format 了解更多。
zh_hant: 已生成非 .NET SDK 格式的專案。更多資訊請參閱 https://docs.microsoft.com/zh-tw/nuget/resources/check-project-format。

# ProjectExportFormatSDKHint
source: A SDK-style project was generated. Learn more at https://docs.microsoft.com/en-us/nuget/resources/check-project-format.
de: Hinweis: SDK-Format wird verwendet.
zh_hans: 已生成 SDK 样式项目。 访问 https://docs.microsoft.com/zh-cn//nuget/resources/check-project-format 了解更多。
zh_hant: 已生成 .NET SDK 格式的專案。更多資訊請參閱 https://docs.microsoft.com/zh-tw/nuget/resources/check-project-format。

# ProjectExportPathTooLong
source: Failed to decompile the assemblies {0} because the namespace names are too long or the directory structure is nested too deep. If you are using Windows 10.0.14393 (Windows 10 version 1607) or later, you can enable "Long path support" by creating a REG_DWORD registry key named "LongPathsEnabled" with value 0x1 at "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem" (see https://docs.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation for more information). If this does not solve the problem and your system supports long paths, you can try to use a nested path structure. You can change this by toggling the setting at Options > Decompiler > Project export > Use nested directories for namespaces. This helps because even on "long-path-aware" platforms, the length of a directory name is limited, on Windows/NTFS this is 255 characters.
de: Dekompilierung der Assembly {0} fehlgeschlagen, da der Namespace-Name zu lang oder die Dateiverschachtelung zu tief ist. Wenn Sie Windows 10.0.14393 (Windows 10 Version 1607) oder neuer verwenden, können Sie die Unterstützung für lange Pfade aktivieren, indem Sie in der Registrierung unter "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem" den Wert "LongPathsEnabled" auf 0x1 setzen. Wenn Ihr System bereits lange Pfade unterstützt, das Problem aber weiterhin besteht, versuchen Sie, verschachtelte Verzeichnisse zu aktivieren. Dies können Sie in den Optionen unter Decompiler > Projekte exportieren > Verschachtelte Verzeichnisse für Namespaces verwenden aktivieren. Dies sollte das Problem beheben, da auch auf Plattformen mit Unterstützung für lange Pfade die maximale Länge eines einzelnen Ordnernamens (z.B. 255 Zeichen unter Windows/NTFS) begrenzt ist.
zh_hans: 反编译程序集 {0} 失败，因为命名空间的名字过长或文件嵌套过深。 如果你正在使用 Windows 10.0.14393 (Windows 10 version 1607) 或更新的版本，你可以通过在注册表 "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem" 中新建键值 “LongPathsEnabled”，并将其值设为 0x1，以启用 “长路径支持” 如果你的系统已经支持长路径，但仍然出现这个问题。你可以尝试启用嵌套目录，你可以通过勾选 选项 > 反编译器 > 项目导出 > 为命名空间使用嵌套目录 复选框启用这项设置。这应该可以解决问题，因为即便是在支持长路径的平台，一个文件夹的名称长度仍然是有限的，在 Windows/NTFS 上该限制为 255 字符。
zh_hant: 無法反編譯 "{0}" 程式集，因為其命名空間過長或資料夾結構過深。 如果使用的系統是 Windows 10.0.14393 (Windows 10 1607 版) 或更新的版本，您可以通過在 "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem" 機碼內建立 "LongPathsEnabled" 欄位(類型為 REG_DWORD)，並將其設為 0x1 來啟動 "長路徑支援" (請前往 https://docs.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation 了解更多資訊)。 如果上述方案無法解決您的問題，或是系統不支援長路徑的話，可以嘗試使用巢狀路徑結構。(通過點選 "選項 > 反編譯器 > 匯出專案 > 為命名空間使用巢狀路徑" 來開啟/關閉) (即便是在開啟"長路徑支援"的平台，單個資料夾的名稱長度依然是有限制的。以 Windows/NTFS 系統為例，最大長度的限制為 255 個字元。)

# PropertyManuallyMissingReferencesListLoadedAssemblies
source: for ex. property getter/setter access. To get optimal decompilation results, please manually add the missing references to the list of loaded assemblies.
de: Liste der geladenen Assemblys mit fehlenden Referenzen
zh_hans: 例如属性 getter/setter 访问。要获得最佳反编译结果，请手动将缺少的引用添加到加载的程序集列表中。
zh_hant: 例如: 屬性的 getter/setter 存取。要取得最佳的反編譯結果，請在載入的程式集列表之中手動加入缺失的參考

# PublicToken
source: Public Key Token
de: Öffentlicher Token
zh_hans: 公钥标记
zh_hant: 公鑰權杖

source: R_ename
de: U_mbenennen
zh_hans: 重命名(_E)
zh_hant: 重新命名(_E)

source: Reference Name
de: Referenzname
zh_hans: 引用名称
zh_hant: 參考名稱

source: References
de: Referenzen
zh_hans: 引用
zh_hant: 參考

# RefreshCommand_ReloadAssemblies
source: Reload all assemblies
de: Assemblys neu laden
zh_hans: 重新加载程序集
zh_hant: 重新載入所有程式集

# ReloadAssemblies
source: Reload all assemblies
de: Assemblys neu laden
zh_hans: 重新加载全部程序集
zh_hant: 重新載入所有程式集

source: Remove
de: Entfernen
zh_hans: 移除
zh_hant: 移除

# RemoveDeadSideEffectFreeCode
source: Remove dead and side effect free code
de: Nebenwirkungsfreien Code entfernen
zh_hans: 删除死代码和无副作用的代码
zh_hant: 刪除死程式碼和無副作用的程式碼

source: Remove shell integration
de: Explorer-Integration entfernen
zh_hans: 移除文件资源管理器集成
zh_hant: 移除系統殼層整合

# RemoveShellIntegrationMessage
source: This will remove "{0}" from the registry at "HKCU\Software\Classes\dllfile\shell\Open with ILSpy\command" and "HKCU\Software\Classes\exefile\shell\Open with ILSpy\command". Do you want to continue?
de: Möchten Sie fortfahren?
zh_hans: 这会在注册表的“HKCU\Software\Classes\dllfile\shell\Open with ILSpy\command”与“HKCU\Software\Classes\exefile\shell\Open with ILSpy\command”中移除“{0}”。 确定继续？
zh_hant: 這會從系統登錄的 "HKCU\Software\Classes\dllfile\shell\Open with ILSpy\command" 和 "HKCU\Software\Classes\exefile\shell\Open with ILSpy\command" 機碼當中移除 "{0}" 是否要繼續?

source: Rename list
de: Liste umbenennen
zh_hans: 重命名列表
zh_hant: 重新命名列表

source: Reset to defaults
de: Auf Standard zurücksetzen
zh_hans: 还原到默认值
zh_hant: 還原至預設值

# ResetToDefaultsConfirmationMessage
source: Do you really want to load the default settings for the active page?
de: Wirklich auf Standardwerte zurücksetzen?
zh_hans: 是否为活动页面加载默认值？
zh_hant: 是否為活動中的頁面加載預設設定?

# ResourcesFileFilter
source: Resources file (*.resources)|*.resources|Resource XML file|*.resx
de: Ressourcendateien
zh_hans: 资源文件|*.resources|XML资源文件|*.resx
zh_hant: 資源檔|*.resources|XML 資源檔|*.resx

source: Save
de: Speichern
zh_hans: 保存
zh_hant: 儲存

source: Save Code
de: Code speichern
zh_hans: 保存代码
zh_hant: 儲存程式碼

source: Scope search to this assembly
de: Suche auf diese Assembly beschränken
zh_hans: 在此程序集中搜索
zh_hant: 在此程式集內進行搜尋

source: Scope search to this namespace
de: Suche auf diesen Namespace beschränken
zh_hans: 在此命名空间中搜索
zh_hant: 在此命名空間內進行搜尋

source: Search...
de: Suchen
zh_hans: 搜索...
zh_hant: 搜尋...

source: Search aborted, more than 1000 results found.
de: Suche abgebrochen: Mehr als 1000 Ergebnisse gefunden
zh_hans: 搜索已中止，发现超过1000个结果。
zh_hant: 由於發現超過 1000 筆結果，搜尋已終止。

source: Search (Ctrl+Shift+F or Ctrl+E)
de: Strg+Shift+F oder Strg+E zum Suchen
zh_hans: 搜索(Ctrl + Shift + F 或 Ctrl + E)
zh_hant: 搜尋 (Ctrl+Shift+F 或 Ctrl+E)

# SearchMSDN
source: Search Microsoft Docs...
de: MSDN durchsuchen
zh_hans: 搜索 Microsoft Docs...
zh_hant: 搜尋 Microsoft Docs...

# SearchPane_Search
source: Search
de: Suchbereich
zh_hans: 搜索
zh_hant: 搜尋

source: Searching...
de: Suche läuft...
zh_hans: 搜索...
zh_hant: 搜尋中...

# Select
source: Select All
de: Auswählen
zh_hans: 全部选择
zh_hant: 全選

# SelectAssembliesOpen
source: Select assemblies to open:
de: Zu öffnende Assemblys auswählen
zh_hans: 选择要打开的程序集：
zh_hant: 選擇要開啟的程式集...

# SelectAssemblyListDropdownTooltip
source: Select a list of assemblies (Alt+A)
de: Assembly-Liste auswählen
zh_hans: 选择一个程序集列表
zh_hant: 選擇一個程式集列表 (Alt+A)

# SelectLanguageDropdownTooltip
source: Select language to decompile to (Alt+L)
de: Sprache auswählen
zh_hans: 选择一个反编译目标语言
zh_hant: 選擇一個反編譯的目標語言 (Alt+L)

# SelectList
source: Select a list:
de: Liste auswählen
zh_hans: 选择一个列表：
zh_hant: 選擇一個列表:

source: Select PDB...
de: PDB auswählen
zh_hans: 选择 PDB...
zh_hant: 選擇 PDB...

# SelectVersionDropdownTooltip
source: Select version of language to output (Alt+E)
de: Version auswählen
zh_hans: 选择输出语言的版本
zh_hant: 選擇輸出語言的版本 (Alt+E)

# SettingsChangeRestartRequired
source: You must restart ILSpy for the change to take effect.
de: Neustart erforderlich nach Änderung der Einstellungen
zh_hans: 你必须重启ILSpy才能使得更改生效。
zh_hant: 需要重啟 ILSpy 才能使變更生效

source: Shell
zh_hant: 殼層

source: Show all types and members
de: Alle Typen und Mitglieder anzeigen
zh_hans: 显示所有类型和成员
zh_hant: 顯示所有類型和成員

# ShowAssemblyLoad
source: Show assembly load log
de: Assembly-Ladevorgang anzeigen
zh_hans: 显示程序集加载日志
zh_hant: 顯示程式集加載紀錄

source: ShowChildIndexInBlock
de: Kinderindex im Block anzeigen
zh_hans: 在块中显示子索引
zh_hant: 在區塊中顯示子索引

# ShowDocumentationDecompiledCode
source: Show XML documentation in decompiled code
de: Dokumentation im dekompilierten Code anzeigen
zh_hans: 在反编译代码中显示 XML 文档
zh_hant: 在反編譯程式碼中附加對應的 XML 方法註釋

source: ShowILRanges
de: IL-Bereiche anzeigen
zh_hans: 显示 IL 范围
zh_hant: 顯示 IL 範圍

# ShowInfoFromDebugSymbolsAvailable
source: Show info from debug symbols, if available
de: Informationen aus Debug-Symbolen verfügbar
zh_hans: 显示调试符号的信息(如果可用)
zh_hant: 顯示偵錯符號的資訊(如果存在)

# ShowInternalTypesMembers
source: Show public, private and internal
de: Interne Typen/Mitglieder anzeigen
zh_hans: 显示内部类型和成员
zh_hant: 顯示 public、private 與 internal 類型和成員

source: Show line numbers
de: Zeilennummern anzeigen
zh_hans: 显示行号
zh_hant: 顯示行號

source: Show metadata tokens
de: Metadaten-Tokens anzeigen
zh_hans: 显示元数据标记
zh_hant: 顯示元資料標記

source: Show metadata tokens in base 10
de: Metadaten-Tokens in Basis 10 anzeigen
zh_hans: 使用十进制显示元数据标记
zh_hant: 顯示元資料標記 (以十進位方式)

# ShowPublicOnlyTypesMembers
source: Show only public types and members
de: Nur öffentliche Typen/Mitglieder anzeigen
zh_hans: 只显示公有类型和成员
zh_hant: 只顯示 public 類型和成員

# ShowRawOffsetsAndBytesBeforeInstruction
source: Show raw offsets and bytes before each instruction
de: Roh-Offsets und Bytes vor Anweisung anzeigen
zh_hans: 在每条 IL 指令前显示原始偏移量和字节
zh_hant: 在每條 IL 指令之前顯示原始偏移量和位元組長度

source: Show state after this step
de: Status nach diesem Schritt anzeigen
zh_hans: 在此步骤之后显示状态
zh_hant: 顯示此步驟之後的狀態

source: Show state before this step
de: Status vor diesem Schritt anzeigen
zh_hans: 在此步骤之前显示状态
zh_hant: 顯示此步驟之前的狀態

source: Show _all types and members
de: Alle Typen und Mitglieder anzeigen
zh_hans: 显示所有类型和成员(_A)
zh_hant: 顯示所有類型和成員

# Show_internalTypesMembers
source: Show public, private and internal
de: Interne Typen/Mitglieder anzeigen
zh_hans: 显示内部类型和成员(_I)
zh_hant: 顯示 public、private 與 internal 類型和成員

# Show_publiconlyTypesMembers
source: Show only _public types and members
de: Nur öffentliche Typen/Mitglieder anzeigen
zh_hans: 只显示公有类型和成员(_P)
zh_hant: 只顯示 public 類型和成員(_P)

source: Size:
de: Größe
zh_hans: 大小：
zh_hant: 大小:

# SortAssemblyListName
source: Sort assembly list by name
de: Assembly-Liste nach Name sortieren
zh_hans: 按名称排列程序集列表
zh_hant: 按名稱排列程式集列表

# SortAssembly_listName
source: Sort assembly _list by name
de: Assembly-Liste nach Name sortieren
zh_hans: 按名称排列程序集列表(_L)
zh_hant: 按名稱排列程式集列表(_L)

# SortResultsFitness
source: Sort results by fitness
de: Ergebnisse nach Relevanz sortieren
zh_hans: 排序结果自适应
zh_hant: 按合適度排序結果

source: Stand by...
de: Bereit
zh_hans: 就绪...
zh_hant: 就緒...

source: Status
zh_hans: 状态
zh_hant: 狀態

source: String Table
de: Zeichentabelle
zh_hans: 字符串表
zh_hant: 字串表

source: Style the window title bar
de: Fenstertitelleiste gestalten
zh_hans: 为窗口标题栏应用自定义样式
zh_hant: 為視窗標題欄應用客製化樣式

source: Tab size:
de: Tabulatorgröße
zh_hans: Tab 长度：
zh_hant: Tab 長度:

source: Theme
de: Thema
zh_hans: 主题
zh_hant: 主題

# ToggleFolding
source: Toggle All Folding
de: Faltung umschalten
zh_hans: 切换所有折叠
zh_hant: 將全部展開/摺疊

source: Tree view options
de: Baumansicht-Optionen
zh_hans: 树视图选项
zh_hant: 樹狀圖選項

source: Type
de: Typ
zh_hans: 类型
zh_hant: 類型

source: UI Language
de: UI-Sprache
zh_hans: 语言
zh_hant: 語言

# UILanguage_System
source: System
de: Systemsprache
zh_hans: 系统
zh_hant: 系統

# UpdateILSpyFound
source: No update for ILSpy found.
de: Update für ILSpy gefunden
zh_hans: 找不到 ILSpy 的更新。
zh_hant: 暫無更新的 ILSpy 的版本

source: UseFieldSugar
de: Feld-Syntax verwenden
zh_hans: 使用 fld 语法糖
zh_hant: 使用欄位語法糖

source: UseLogicOperationSugar
de: Logik-Operationen-Syntax verwenden
zh_hans: 使用 logic 语法糖
zh_hant: 使用邏輯語法糖

# UseNestedNamespaceNodes
source: Use nested namespace structure
de: Verschachtelte Namespace-Knoten verwenden
zh_hans: 使用嵌套的命名空间结构
zh_hant: 使用巢狀的命名空間結構

source: Use tabs instead of spaces
de: Tabs statt Leerzeichen verwenden
zh_hans: 使用 Tab 替代空格
zh_hant: 使用 Tab 替代空格

# UsingLatestRelease
source: You are using the latest release.
de: Neueste Version wird verwendet
zh_hans: 您使用的是最新版本。
zh_hant: 目前所使用的是最新的正式版本。

# UsingNightlyBuildNewerThanLatestRelease
source: You are using a nightly build newer than the latest release.
de: Nightly Build ist neuer als die letzte Release-Version
zh_hans: 您使用的是每日构建版本，比最新版本更新。
zh_hant: 目前所使用的是每日建置版本，比最新的正式版本還要新。

source: Value
de: Wert
zh_hans: 值
zh_hant: 值

# ValueString
source: Value (as string)
de: Wert (Zeichenfolge)
zh_hans: 值(以字符串形式)
zh_hant: 值(以字串形式)

# VariableNamesFromDebugSymbolsAvailable
source: Use variable names from debug symbols, if available
de: Variablennamen aus Debug-Symbolen verfügbar
zh_hans: 使用调试符号中的变量名称(如果可用)
zh_hant: 使用偵錯符號中的變數名稱(如果存在)

source: Version
zh_hans: 版本
zh_hant: 版本

# VersionAvailable
source: Version {0} is available.
de: Version verfügbar
zh_hans: 版本 {0} 已可用。
zh_hant: {0} 版本已可下載和安裝

source: View
de: Ansicht
zh_hans: 视图
zh_hant: 檢視

source: Visual Studio Solution file|*.sln|All files|*.*
de: Alle Visual Studio Solution-Dateien (*.sln)
zh_hans: Visual Studio 解决方案文件(*.sln)|*.sln|所有文件(*.*)|*.*
zh_hant: Visual Studio 解決方案檔案|*.sln|所有檔案|*.*

# WarningAsmMarkedRef
source: Warning: This assembly is marked as 'reference assembly', which means that it only contains metadata and no executable code.
de: Warnung: Assembly als Referenz markiert
zh_hans: 警告：此程序集被标记为“引用程序集”，这意味着它只包含元数据，没有可执行代码。
zh_hant: 警告: 此程式集被標記為"參考程式集"，這意味著它只包含元資料，不包含任何可執行的程式碼。

# WarningSomeAssemblyReference
source: Warning: Some assembly references could not be resolved automatically. This might lead to incorrect decompilation of some parts,
de: Warnung: Einige Assembly-Referenzen fehlen
zh_hans: 警告：某些程序集引用无法自动解析。这可能会导致某些部分反编译错误，
zh_hant: 警告: 部分程式集參考無法自動解析，這可能會使部分內容出現不正確的反編譯結果。

# WatermarkText
source: Search for t:TypeName, m:Member or c:Constant; use exact match (=term), 'should not contain' (-term) or 'must contain' (+term); use /reg(ular)?Ex(pressions)?/ or both - t:/Type(Name)?/...
de: Wasserzeichen-Text
zh_hans: 搜索 t:类型、m:成员 或 c:常量；使用完全匹配(=term)、不应包含(-term)或必须包含(+term)；使用 /正(则)?表达(式)?/；或同时使用二者 - t:/类(型)?/...
zh_hant: 搜尋 t:<類型名稱> m:<成員名稱> 或 c:<常數名稱>; "精確比對"(=term), "不包含"(-term) 或"必須包含" (+term); 使用 /<正規表示式>/ 或結合兩者: t:/<類型名稱的正規表示式>/...

# Window_CloseAllDocuments
source: _Close all documents
de: Alle Dokumente schließen
zh_hans: 关闭所有文档(_C)
zh_hant: 關閉所有文件(_C)

# Window_ResetLayout
source: _Reset layout
de: Layout zurücksetzen
zh_hans: 重置布局(_R)
zh_hant: 重置版面配置(_R)

source: _About
de: Ü_ber
zh_hans: 关于(_A)
zh_hant: 關於(_A)

# _AddMainList
source: _Add To Main List
de: Hauptliste hinzufügen
zh_hans: 添加到主列表(_A)
zh_hant: 加入至主列表(_A)

source: Analy_zer
de: Analysator
zh_hans: 分析器(_A)
zh_hant: 分析器(_Z)

source: _Assemblies
de: Assemblys
zh_hans: 程序集(_A)
zh_hant: 程式集(_A)

# _CheckUpdates
source: _Check for Updates
de: Nach Updates suchen
zh_hans: 检查更新(_C)
zh_hant: 檢查更新(_C)

# _CollapseTreeNodes
source: _Collapse all tree nodes
de: Knoten reduzieren
zh_hans: 折叠所有树节点(_C)
zh_hant: 摺疊所有樹節點(_C)

source: _File
de: Datei
zh_hans: 文件(_F)
zh_hant: 檔案(_F)

source: _Help
de: Hilfe
zh_hans: 帮助(_H)
zh_hant: 說明(_O)

source: _Load Dependencies
de: Abhängigkeiten laden
zh_hans: 加载依赖(_L)
zh_hant: 載入相依性(_L)

source: _New
de: Neu
zh_hans: 新建(_N)
zh_hant: 新增(_N)

source: _Open...
de: Öffnen
zh_hans: 打开(_O)...
zh_hant: 開啟(_O)...

source: _Open Command Line Here
de: Kommandozeile hier öffnen
zh_hans: 在这里打开命令行(_O)
zh_hant: 於此處啟動命令提示字元(_O)

source: _Open Containing Folder
de: Enthaltenden Ordner öffnen
zh_hans: 打开包含文件夹(_O)
zh_hant: 在檔案總管中開啟(_O)

source: _Options...
de: Optionen
zh_hans: 选项(_O)...
zh_hant: 選項(_O)...

source: _Reload
de: Neu laden
zh_hans: 重新加载(_R)
zh_hant: 重新載入(_R)

source: _Remove
de: Entfernen
zh_hans: 移除(_R)
zh_hant: 移除(_R)

source: _Remove Assemblies with load errors
de: Assemblys mit Ladefehlern entfernen
zh_hans: 移除程序集及其加载错误(_R)
zh_hant: 移除程式集與其加載錯誤(_R)

source: _Reset
de: Zurücksetzen
zh_hans: 重置(_R)
zh_hant: 重置(_R)

source: Resources
de: Ressourcen
zh_hans: 资源
zh_hant: 資源

source: _Save Code...
de: Code speichern
zh_hans: 保存代码(_S)...
zh_hant: 儲存程式碼(_S):

source: _Search:
de: Suchen
zh_hans: 搜索(_S):
zh_hant: 搜尋(_S):

source: _Search for:
de: Suchen nach
zh_hans: 搜索(_S):
zh_hant: 搜尋(_S):

source: _Show debug steps
de: Debug-Schritte anzeigen
zh_hans: 显示调试步骤(_S)
zh_hant: 顯示偵錯步驟(_S)

source: Toggle Folding
de: Faltung umschalten
zh_hans: 切换折叠
zh_hant: 切換展開/摺疊

source: _View
de: Ansicht
zh_hans: 视图(_V)
zh_hant: 檢視(_V)

source: _Window
de: Fenster
zh_hans: 窗口(_W)
zh_hant: 視窗(_W)
